<a href="https://colab.research.google.com/github/hussain0048/Water-borne-diseases/blob/main/Watern_Brone_Disease_3_23_21_(Malaria)_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **1- Introduction**
 the water-borne diseases are the most common which transmitted in contaminated fresh water, whether in bathing, washing, drinking, or in the preparation of food.. More than one-third of Earth&#39;s accessible renewable freshwater is consumptively used for agricultural, industrial, and
domestic purposes. Water-borne diseases are commonly found throughout the world but the
condition is more aggravated in developing countries including Pakistan.

#**2-Importing libraries**

In [ ]:
import numpy as np 
import pandas as pd 
import seaborn as sns 
import matplotlib.pyplot as plt
from prettytable import PrettyTable
from sklearn.metrics import roc_curve, auc
from mlxtend.plotting import plot_confusion_matrix 
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report, confusion_matrix
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.svm import LinearSVC
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier
import warnings
warnings.filterwarnings("ignore")

In [ ]:
import pandas as pd

#**3-Processing**

## **3.1 Data Reading**

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [172]:
df = pd.read_csv('/content/drive/MyDrive/Datasets/Water Brone diesease/Malyria_2-21-2021.csv',encoding = 'latin')

In [ ]:
df.head()

## 3.2- **Drop Columns**

In [174]:
df.drop(labels=['Unnamed: 0', 'SECTION_NO', 'MRNO', 'PATIENT_NAME', 'FATHER_NAME',
       'HUSBAND_NAME', 'NIC_NEW', 'REFERRED_FROM', 'NO_OF_ADMISSION', 'TEHSIL', 'REPORT_VERIFIED', 'CPT_ID',
       'RESULT_VALUE', 'CPT_ID.1', 'SECTION_NO.1'],axis=1,inplace=True)

In [175]:
df

              AGE  GENDER    DISTRICT RESULT_TEXT
0      34 Year(s)    Male  Abbottabad    Negative
1      43 Year(s)    Male  Abbottabad    Negative
2      43 Year(s)    Male  Abbottabad    Negative
3      28 Year(s)    Male  Abbottabad    Negative
4      42 Year(s)    Male  Abbottabad    Negative
...           ...     ...         ...         ...
22911  13 Year(s)    Male     Haripur    Negative
22912  20 Year(s)    Male  Abbottabad    Negative
22913  21 Year(s)    Male  Abbottabad    Negative
22914  45 Year(s)  Female  Abbottabad    Negative
22915  22 Year(s)  Female  Abbottabad    Negative

[22916 rows x 4 columns]

In [176]:
df.head()

          AGE GENDER    DISTRICT RESULT_TEXT
0  34 Year(s)   Male  Abbottabad    Negative
1  43 Year(s)   Male  Abbottabad    Negative
2  43 Year(s)   Male  Abbottabad    Negative
3  28 Year(s)   Male  Abbottabad    Negative
4  42 Year(s)   Male  Abbottabad    Negative

## **3.3 Remove string from Age**

In [177]:
df['Age'] = df['AGE'].str.split().str[0]

In [178]:
df.head()

          AGE GENDER    DISTRICT RESULT_TEXT Age
0  34 Year(s)   Male  Abbottabad    Negative  34
1  43 Year(s)   Male  Abbottabad    Negative  43
2  43 Year(s)   Male  Abbottabad    Negative  43
3  28 Year(s)   Male  Abbottabad    Negative  28
4  42 Year(s)   Male  Abbottabad    Negative  42

In [179]:
df.drop(['AGE'],axis=1,inplace=True)

In [180]:
df

       GENDER    DISTRICT RESULT_TEXT Age
0        Male  Abbottabad    Negative  34
1        Male  Abbottabad    Negative  43
2        Male  Abbottabad    Negative  43
3        Male  Abbottabad    Negative  28
4        Male  Abbottabad    Negative  42
...       ...         ...         ...  ..
22911    Male     Haripur    Negative  13
22912    Male  Abbottabad    Negative  20
22913    Male  Abbottabad    Negative  21
22914  Female  Abbottabad    Negative  45
22915  Female  Abbottabad    Negative  22

[22916 rows x 4 columns]

##**3.4 Convert target variable into binary Form**

In [181]:
df['RESULT_TEXT'].replace({'Negative': 0, 'Positive': 1},inplace = True)

In [182]:
df

       GENDER    DISTRICT  RESULT_TEXT Age
0        Male  Abbottabad            0  34
1        Male  Abbottabad            0  43
2        Male  Abbottabad            0  43
3        Male  Abbottabad            0  28
4        Male  Abbottabad            0  42
...       ...         ...          ...  ..
22911    Male     Haripur            0  13
22912    Male  Abbottabad            0  20
22913    Male  Abbottabad            0  21
22914  Female  Abbottabad            0  45
22915  Female  Abbottabad            0  22

[22916 rows x 4 columns]

## **3.7- Check unique value**

In [ ]:
print(oversampled['DISTRICT'].unique())

['Abbottabad' 'Mansehra' 'Haripur' 'Kohistan' 'Peshawar' 'Batgram' 'Bolan'
 'Shangla' 'RahimYar Khan' 'Mardan' 'MUZAFFARABAD' 'Lower Dir' 'DIAMIR'
 'ISLAMABAD' 'Lasbela' 'GILGIT' 'Vehari' 'Swat' 'Swabi' 'Tharparkar'
 'BAGH' 'UNKNOWN F.A.T.A' 'Mianwali' 'Attock' 'Dadu' 'Charsadda' 'ORAKZAI'
 'MIRPUR' 'KHYBER' 'Lahore' 'Upper Dir' 'Hangu' 'KURRAM' 'Zhob' 'POONCH'
 'Nowshera' 'Rawalpindi' 'MOHMAND']

In [ ]:
print(oversampled['GENDER'].unique())

['Male' 'Female' 'Neuter']

##**3.7 Hot Encoding**

In [183]:
#Label encoding executed manually
DISTRICT_dict = { 'Abbottabad':0, 'Mansehra':1, 'Haripur':2, 'Kohistan':3, 'Peshawar':4, 'Batgram':5, 'Bolan':6, 'Shangla':7, 'RahimYar Khan':8, 'Mardan':9, 'MUZAFFARABAD':10, 'Lower Dir':11, 'DIAMIR':12, 'ISLAMABAD':13, 'Lasbela':14, 'GILGIT':15, 'Vehari':16, 'Swat':17, 'Swabi':18, 'Tharparkar':19,'BAGH':20, 'UNKNOWN F.A.T.A':21, 'Mianwali':22, 'Attock':23, 'Dadu':24, 'Charsadda':25, 'ORAKZAI':26, 'MIRPUR':27, 'KHYBER':28, 'Lahore':29, 'Upper Dir':30, 'Hangu':31, 'KURRAM':32, 'Zhob':33, 'POONCH':34,'Nowshera':35, 'Rawalpindi':36, 'MOHMAND':37}

In [184]:
Gender_dict = { 'Male':1, 'Female':2, 'Neuter':3 }

In [ ]:
df

In [186]:
df['DISTRICT_Encoded']=df['DISTRICT'].map(DISTRICT_dict)

In [ ]:
df

In [189]:
df['Gender_Encoded']=df['GENDER'].map(Gender_dict)

In [191]:
df

       GENDER    DISTRICT  RESULT_TEXT Age  DISTRICT_Encoded  Gender_Encoded
0        Male  Abbottabad            0  34                 0               1
1        Male  Abbottabad            0  43                 0               1
2        Male  Abbottabad            0  43                 0               1
3        Male  Abbottabad            0  28                 0               1
4        Male  Abbottabad            0  42                 0               1
...       ...         ...          ...  ..               ...             ...
22911    Male     Haripur            0  13                 2               1
22912    Male  Abbottabad            0  20                 0               1
22913    Male  Abbottabad            0  21                 0               1
22914  Female  Abbottabad            0  45                 0               2
22915  Female  Abbottabad            0  22                 0               2

[22916 rows x 6 columns]

In [192]:
df = df.drop(['GENDER','DISTRICT'],axis=1)

In [193]:
df

       RESULT_TEXT Age  DISTRICT_Encoded  Gender_Encoded
0                0  34                 0               1
1                0  43                 0               1
2                0  43                 0               1
3                0  28                 0               1
4                0  42                 0               1
...            ...  ..               ...             ...
22911            0  13                 2               1
22912            0  20                 0               1
22913            0  21                 0               1
22914            0  45                 0               2
22915            0  22                 0               2

[22916 rows x 4 columns]

In [207]:
df.shape

(22916, 4)

# **4-Splitting Training and Test Set**

In [195]:
X=df.drop('RESULT_TEXT',axis=1)

In [196]:
y=df[['RESULT_TEXT']]

In [ ]:
# y
X

In [ ]:
y

In [197]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.30, random_state=100)

# **5-Modle Training**

## **5.2-Random Forest**

In [198]:
Ran_For= RandomForestClassifier(n_estimators=100,max_depth=15, random_state=11,max_leaf_nodes=10)
Ran_For= Ran_For.fit(X_train , y_train)
Ran_For

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=15, max_features='auto',
                       max_leaf_nodes=10, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=False, random_state=11, verbose=0,
                       warm_start=False)

In [199]:
y_pred1 = Ran_For.predict(X_test)
rn=Ran_For.score(X_test, y_test)
print('Accuracy score= {:.4f}'.format(Ran_For.score(X_test, y_test)))

Accuracy score= 0.9927

### **Saving model to disk**

In [202]:
import pickle
pickle.dump(Ran_For, open('model_rf2.pkl','wb'))

In [205]:
model = pickle.load(open('/content/model_rf2.pkl','rb'))

In [ ]:
print(model.predict([[43, 1, 1]]))

#**References**

[Random Forest Classification with H2O](https://medium.com/tech-vision/random-forest-classification-with-h2o-python-for-beginners-b31f6e4ccf3c)

[Build and deploy your first machine learning web app](https://towardsdatascience.com/build-and-deploy-your-first-machine-learning-web-app-e020db344a99)

[Car-Price-Prediction](https://github.com/krishnaik06/Car-Price-Prediction/blob/master/Untitled.ipynb)

[Live- Implementation of End To End Kaggle Machine Learning Project With Deployment](https://www.youtube.com/watch?v=p_tpQSY1aTs&ab_channel=KrishNaik)

[Deploy Machine Learning Model using Flask](https://www.youtube.com/watch?v=UbCWoMf80PY&ab_channel=KrishNaik)

[Deployment-flask](https://github.com/krishnaik06/Deployment-flask/blob/master/model.py)